nspode/tct-espressif-mqtt-workshop/sdkconfig.defaults
# Opções mínimas do projeto, usadas quando o sdkconfig é gerado do zero
# (ex.: ao migrar para o ESP-IDF 6.x).
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
CONFIG_MQTT_PROTOCOL_5=y
